examples/dfSprayFoam/sydneySprayBurner/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sprayFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         0.2;

deltaT          2e-07;

writeControl    adjustableRunTime;

writeInterval   0.002;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.3;

runTimeModifiable true;

OptimisationSwitches
{
    fileHandler collated;
    //- collated: thread buffer size for queued file writes.
    //  If set to 0 or not sufficient for the file size, threading is not used.
    //  Default: 1e9
    maxThreadFileBufferSize 0;//1e9;
}


// ************************************************************************* //
