examples/dfSprayFoam/sydneySprayBurner/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
   (0     0                    -50)   // 0

   (5.25  -0.18333403983  -50)   // 1
   (5.25   0.18333403983  -50)   // 2

   (5.75 -0.20079442457 -50)   // 3
   (5.75  0.20079442457 -50)   // 4

   (12.5  -0.43650961864  -50)   // 5
   (12.5   0.43650961864  -50)   // 6

   (0     0                     0)     // 7

   (5.25  -0.18333403983   0)     // 8
   (5.25   0.18333403983   0)     // 9

   (5.75 -0.20079442457  0)     // 10
   (5.75  0.20079442457  0)     // 11

   (12.5  -0.43650961864   0)     // 12
   (12.5   0.43650961864   0)     // 13


   (104  -3.63176002714     0)     // 14
   (104   3.63176002714     0)     // 15

   (0     0                     500)   // 16

   (5.25  -0.18333403983   500)   // 17
   (5.25   0.18333403983   500)   // 18

   (5.75 -0.20079442457  500)   // 19
   (5.75  0.20079442457  500)   // 20

   (12.5  -0.43650961864   500)   // 21
   (12.5  0.43650961864   500)   // 22

   (104  -3.63176002714     500)   // 23
   (104   3.63176002714     500)   // 24
);

blocks
(
    hex ( 0  1  2  0  7  8  9  7)   (11  1 20)   simpleGrading (1 1 1)
    hex ( 3  5  6  4 10 12 13 11)   (13  1 20)   simpleGrading (1 1 1)

    hex ( 7  8  9  7 16 17 18 16)   (11  1 200)   simpleGrading (1 1 2)
    hex ( 8 10 11  9 17 19 20 18)   (1  1 200)   simpleGrading (1 1 2)
    hex (10 12 13 11 19 21 22 20)   (13  1 200)   simpleGrading (1 1 2)
    hex (12 14 15 13 21 23 24 22)   (100 1 200)   simpleGrading (3 1 2)
);

boundary
(
    inletFuel
    {
        type patch;
        faces
        (
            (1 0 0 2)
        );
    }

    wallOutside
    {
        type wall;
        faces
        (
            (14 15 24 23)
        );
    }

    wallTube
    {
        type wall;
        faces
        (
            (1 2 9 8)
            (10 11 9 8)
            (4 3 10 11)
            (5 6 13 12)
        );
    }

    inletPilot
    {
        type patch;
        faces
        (
            (5 3 4 6)
        );
    }

    inletAir
    {
        type patch;
        faces
        (
            (14 12 13 15)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (16 17 18 16)
            (17 19 20 18)
            (19 21 22 20)
            (21 22 24 23)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 7 7 0)
            (7 16 16 7)
        );
    }

    frontAndBack_pos
    {
        type wedge;
        faces
        (
            (2 0 7 9)
            (6 4 11 13)

            (9 7 16 18)
            (11 9 18 20)
            (13 11 20 22)
            (15 13 22 24)
        );
    }

    frontAndBack_neg
    {
        type wedge;
        faces
        (
            (0 1 8 7)
            (3 5 12 10)

            (7 8 17 16)
            (8 10 19 17)
            (10 12 21 19)
            (12 14 23 21)
        );
    }
);

// ************************************************************************* //
