examples/dfSprayFoam/sydneySprayBurner/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inletFuel
    {
        type            patch;
        nFaces          11;
        startFace       50595;
    }
    wallOutside
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       50606;
    }
    wallTube
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          61;
        startFace       50806;
    }
    inletPilot
    {
        type            patch;
        nFaces          13;
        startFace       50867;
    }
    inletAir
    {
        type            patch;
        nFaces          100;
        startFace       50880;
    }
    outlet
    {
        type            patch;
        nFaces          125;
        startFace       50980;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       51105;
    }
    frontAndBack_pos
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          25480;
        startFace       51105;
    }
    frontAndBack_neg
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          25480;
        startFace       76585;
    }
)

// ************************************************************************* //
