examples/dfSprayFoam/sydneySprayBurner/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


chemistry           on;
CanteraMechanismFile "ethanol66.yaml";
transportModel "Mix";//"UnityLewis";
odeCoeffs
{
    "relTol"   1e-6;
    "absTol"   1e-10;
}
inertSpecie        "N2";

zeroDReactor
{
    //cvorcp "UV";
}

splittingStrategy    off;

TorchSettings
{
    torch off;
    GPU   off;
    log  on;
    torchModel1 ""; 
    torchModel2 ""; 
    torchModel3 ""; 
    coresPerNode 8;
}


loadbalancing
{
        active  false;
        //log   true;
}
// ************************************************************************* //
