examples/dfSprayFoam/sydneySprayBurner/constant/chemkin/chemkin.inp
ELEMENTS
O  N  HE AR H  C  
END
SPECIES
CH2OH           H2O             O               CH3O
HO2             CO2             OH              N2
O2              HCO             H2O2            CH4
CH2O            CH3             CH3OH           H2
H               CO              
END
REACTIONS
CH2OH+O2=>CH2O+HO2                            1.6211E+14   0.00000    5017.000
CH2O+HO2=>CH2OH+O2                            3.8506E+15  -0.12690   25426.450
H2+OH=>H+H2O                                  6.2119E+13   0.00000    6990.000
H+H2O=>H2+OH                                  4.0260E+15  -0.36380   22641.320
H2+O=>H+OH                                    5.0800E+04   2.67000    6292.000
H+OH=>H2+O                                    3.7800E+04   2.60750    4963.430
CH2OH+HO2=>CH2O+H2O2                          1.4205E+12   0.00000       0.000
H+OH+M=>H2O+M                                 3.5000E+22  -2.00000       0.000
H2/0.73/ H2O/3.65/ CH4/2/
O2+H=>O+OH                                    1.0400E+14   0.00000   15286.000
O+OH=>O2+H                                    2.7690E+11   0.40110   -1483.240
CH2OH+OH=>H2O+CH2O                            4.5695E+13   0.00000       0.000
CH3O+O2=>CH2O+HO2                             2.3974E-19   9.50000   -5501.000
H2O2(+M)=>2OH(+M)                             2.0000E+12   0.90000   48748.990
H2O/7.65/ CO2/1.6/ N2/1.5/ O2/1.2/ H2O2/7.7/ H2/3.7/ CO/2.8/
LOW /     2.4900E+24        -2.30000       48748.990/
TROE /     4.3000E-01      1.0000E-30      1.0000E+30 /
2OH(+M)=>H2O2(+M)                             1.6060E+05   2.35580   -3518.090
H2O/7.65/ CO2/1.6/ N2/1.5/ O2/1.2/ H2O2/7.7/ H2/3.7/ CO/2.8/
LOW /     2.0000E+17        -0.84000       -3518.090/
TROE /     4.3000E-01      1.0000E-30      1.0000E+30 /
H2O2+H=>H2+HO2                                2.1500E+10   1.00000    6000.000
H2+HO2=>H2O2+H                                6.0890E+07   1.63050   21998.800
CH2O(+M)=>CO+H2(+M)                           6.3368E+13   0.02050   82259.230
H2/2/ H2O/6/ CO/1.5/ CO2/2/ CH4/2/
LOW /     5.2047E+33        -4.90000       87007.230/
TROE /     9.3200E-01      1.9700E+02      1.5400E+03      1.0300E+04 /
CH2O+O=>HCO+OH                                5.2409E+09   1.15000    2260.000
CH2O+H=>HCO+H2                                3.1043E+07   1.90000    2740.000
CH2O+OH=>HCO+H2O                              7.7247E+07   1.63000   -1055.000
HCO+H2O=>CH2O+OH                              1.2443E+06   1.82360   29191.440
CH2O+HO2=>HCO+H2O2                            2.0724E+04   2.70000   11520.000
HO2+H=>H2+O2                                  1.1400E+10   1.08270     553.780
H2+O2=>HO2+H                                  5.4430E+08   1.59470   54719.410
OH+HO2=>H2O+O2                                7.0000E+12   0.00000   -1092.960
DUP
2HO2=>H2O2+O2                                 1.0000E+14   0.00000   11040.880
DUP
2HO2=>H2O2+O2                                 1.9000E+11   0.00000   -1408.920
DUP
HO2+H=>2OH                                    7.0790E+13   0.00000     295.000
2OH=>HO2+H                                    6.6960E+09   0.85060   36362.820
HCO+M=>H+CO+M                                 5.7000E+11   0.66000   14870.000
H2/2/ H2O/6/ CO/1.5/ CO2/2/ CH4/2/
H+CO+M=>HCO+M                                 4.1030E+08   1.58210   -2384.350
H2/2/ H2O/6/ CO/1.5/ CO2/2/ CH4/2/
CO+OH=>CO2+H                                  7.0150E+04   2.05300    -355.700
CO2+H=>CO+OH                                  3.8290E+11   0.77510   25308.850
HCO+O2=>CO+HO2                                6.6758E+12   0.00000     410.000
CH2O+CH3O=>HCO+CH3OH                          2.7367E+11   0.00000    2294.000
H+O2(+M)=>HO2(+M)                             4.6500E+12   0.44000       0.000
H2/1.3/ CO/1.9/ CO2/3.8/ H2O/10/ CH4/2/
LOW /     1.7370E+19        -1.23000           0.000/
TROE /     6.7000E-01      1.0000E-30      1.0000E+30      1.0000E+30 /
HO2(+M)=>H+O2(+M)                             3.2490E+14  -0.04660   50168.080
H2/1.3/ CO/1.9/ CO2/3.8/ H2O/10/ CH4/2/
LOW /     1.2140E+21        -1.72000       50168.080/
TROE /     6.7000E-01      1.0000E-30      1.0000E+30      1.0000E+30 /
OH+HO2=>H2O+O2                                4.5000E+14   0.00000   10929.600
DUP
H2O+O2=>OH+HO2                                1.9750E+15   0.14820   80746.550
CH2O+H(+M)=>CH2OH(+M)                         7.3512E+11   0.45400    3600.000
H2/2/ H2O/6/ CO/1.5/ CO2/2/ CH4/2/
LOW /     7.0205E+31        -4.82000        6530.000/
TROE /     7.1870E-01      1.0300E+02      1.2910E+03      4.1600E+03 /
CH2OH(+M)=>CH2O+H(+M)                         3.6522E+12   0.09420   33358.630
H2/2/ H2O/6/ CO/1.5/ CO2/2/ CH4/2/
LOW /     5.0403E+32        -5.18000       36288.630/
TROE /     7.1870E-01      1.0300E+02      1.2910E+03      4.1600E+03 /
CH3O(+M)=>CH2O+H(+M)                          2.4668E+13   0.00000   26170.000
H2/2/ H2O/6/ CO/1.5/ CO2/2/ CH4/2/
LOW /     4.9534E+24        -3.00000       24307.000/
TROE /     9.0000E-01      2.5000E+03      1.3000E+03      1.0000E+99 /
CH3+OH(+M)=>CH2OH+H(+M)                       1.0002E+09   0.99600      31.000
LOW /     1.0085E+07         5.01000        1887.000/
TROE /     8.6220E-01      9.3210E+03      3.6180E+02      3.1250E+03 /
CH3OH(+M)=>CH3+OH(+M)                         2.2172E+18  -0.61500   92540.590
LOW /     9.4041E+42        -7.00000       97992.190/
TROE /    -4.7480E-01      3.5580E+04      1.1160E+03      9.0230E+03 /
CH3OH+H=>CH3O+H2                              1.4100E+05   2.56000   10300.000
CH3O+H2=>CH3OH+H                              2.6789E+04   2.63200    8116.770
CH3OH+H=>CH2OH+H2                             4.7881E+05   2.55000    5440.000
CH3OH+O=>CH3O+OH                              3.3881E+04   2.50000    3080.000
CH3OH+O=>CH2OH+OH                             5.1127E+05   2.50000    3080.000
CH3OH+OH=>CH2OH+H2O                           1.6181E+04   2.65000    -806.700
CH3OH+HO2=>CH3O+H2O2                          2.1136E+12   0.00000   20070.700
CH3OH+HO2=>CH2OH+H2O2                         3.6901E+13   0.00000   18782.200
CH3OH+CH3=>CH3O+CH4                           1.0453E+04   2.42500    8579.500
CH3OH+HCO=>CH2OH+CH2O                         8.9697E+03   2.90000   13110.000
CH2OH+CH2O=>CH3OH+HCO                         1.4302E+02   3.27650    3762.260
END
