examples/dfSprayFoam/sydneySprayBurner/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 4.5);

boundaryField
{
    wallTube
    {
        type            noSlip;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    inletPilot
    {
        type            fixedValue;
        value           uniform (0 0 11.6);
    }

    inletAir
    {
        type            fixedValue;
        value           uniform (0 0 4.5);
    }

    wallOutside
    {
        type            zeroGradient;
    }

    inletFuel
    {
        type            fixedValue;
        value           uniform (0 0 24);
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
