examples/dfSprayFoam/sydneySprayBurner/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1527;

boundaryField
{
    wallTube
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1527;
    }

    outlet
    {
        type            zeroGradient;
    }

    inletPilot
    {
//        type            turbulentMixingLengthDissipationRateInlet;
//        mixingLength    0.000735;
//        phi             phi;
//        k               k;
//        value           uniform 1;
        type            fixedValue;
        value           uniform 13.95;

    }

    inletAir
    {
     /*   type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.019677;
        value           uniform 1; */
        type            fixedValue;
        value           uniform 13.95;
    }

    wallOutside
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 30000;
    }

    inletFuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000504;
        phi             phi;
        k               k;
        value           uniform 1;
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
