examples/dfSprayFoam/sydneySprayBurner/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=dfSprayFoam

runApplication blockMesh
runApplication decomposePar
runApplication mpirun -np 8 $application -parallel >log.dfSprayForam 2>&1 &
